# BuiltInFailures.ScaleFailures Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
BuiltInFailures..::..ScaleFailures Members
BuiltInFailures..::..ScaleFailures Class Properties See Also
---
Provides a container of all Revit built-in FailureDefinitionId instances.
The BuiltInFailures..::..ScaleFailures type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CannotScaleLinkWithSharedCoordinates | Can't scale link that shares coordinates with host model |

# See Also
BuiltInFailures..::..ScaleFailures Class
Autodesk.Revit.DB Namespace